ncdnt-backend/app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
    def index
        reports = Report.all

INSERT INTO "reports" ("suspect_desc", "event_desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["suspect_desc", "sdf"], ["event_desc", "asda"], ["created_at", "2020-09-21 07:46:02.077135"], ["updated_at", "2020-09-21 07:46:02.077135"]]
---
    def create
        report = Report.create!(report_params)